tap "homebrew/cask"
tap "homebrew/cask-fonts"

brew "ansible"
brew "bat"
brew "coreutils"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "git"
brew "gnu-sed"
brew "go"
brew "gopls"
brew "gpg2"
brew "grep"
brew "htop"
brew "jq"
brew "lsd"
brew "neovim"
brew "pinentry-mac"
brew "ripgrep"
brew "starship"
brew "tmux", args: ["HEAD"]
brew "watch"
brew "wget"
brew "yq"
brew "zsh"

cask "amethyst"
cask "anki"
cask "bitwarden"
cask "hammerspoon"
cask "karabiner-elements"
cask "slack"
cask "spotify"
cask "visual-studio-code"
cask "vlc"
cask "warp"

# Fonts
cask "font-fira-code-nerd-font"
cask "font-fira-mono-nerd-font"
cask "font-hack-nerd-font"
cask "font-ubuntu-mono-nerd-font"

# Kube Specific stuff
brew "podman"
cask "podman-desktop"
brew "kind"
brew "minikube"
brew "helm"
